# Откройте текстовый файл для чтения task1.txt.
# Подсчитайте:
# Общее количество строк в файле.
# Общее количество слов во всем тексте файла.
# Общее количество символов (включая пробелы).
# Выведите полученную статистику на экран.
with open('task1.txt', 'r', encoding='utf-8') as f:
    fl = f.readlines()

    print('строк',len(fl))

count = 1
a = 0
b = 0
for i in fl:
    count = count + 1
    b = b +(len(i.replace('\n',''))) #количество символов
    a = a +(len(i.replace(' — ', ' ').split())) #количество слов
print('слов:',a,'символов:', b)
# print(fl.count())

