# Напишите программу, которая просит пользователя ввести несколько предложений (например, 5, каждое предложение с новой строки).
# Каждое введенное предложение записывается в файл, но:
# Слова во всех предложениях должны быть приведены к верхнему регистру.
# Между словами вместо пробела ставится символ "_".
# После записи откройте этот файл, считайте содержимое и выведите его на экран.

nfl4 = input('введите 5 предложений')

nfl4 = nfl4.upper()

nfl4 = nfl4.replace(" ", "_")

d = open('new-file4.txt', 'w', encoding='utf-8')
d.write(nfl4)
d.close()


